Repository: sownthunder/Data-Developer-Droolkit
Catalog: GUI2Exe_0.5.3/scripts/catalogs/Gui2Exe_*.po
Languages: it_it

source: %(compiler)s options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni %(compiler)s per il progetto %(projectName)s (Data di creazione: %(creationDate)s)

source: %(dictionaryItems)d key/value pairs
it_it: %(dictionaryItems)d coppie chiave/valore

source: %(numberOfObjects)d ordered objects
it_it: %(numberOfObjects)d oggetti ordinati

source: &About GUI2Exe...
it_it: &A proposito di GUI2Exe...

source: &Binary dependencies
it_it: Files &binary necessari

source: &Builds
it_it: &Eseguibili

source: &Check setup script syntax
it_it: &Controlla la sintassi del file di setup

source: &Contact the Author...
it_it: &Contatta l'autore...

source: &Export setup file...
it_it: Es&porta il file di setup...

source: &Help
it_it: &Aiuto

source: &Insert post compilation code...
it_it: &Inserisci codice post-compilazione...

source: &Missing modules
it_it: &Moduli mancanti

source: &New project...
it_it: &Nuovo progetto...

source: &Options
it_it: &Opzioni

source: &Quit
it_it: &Esci

source: &Recurse sub-dirs for data_files option
it_it: Includi sotto-di&rectory per l'opzione data_files

source: &Save project
it_it: &Salva Progetto

source: &Save project as...
it_it: Salva il p&rogetto come...

source: &Test executable
it_it: &Testa l'eseguibile

source: &Tips and tricks
it_it: Consigli e &trucchi

source: &View
it_it: &Visualizza

source: 0 key/value pairs
it_it: 0 coppie chiave/valore

source: A list of scripts specified as file names. Hit Ctrl+A to select one or more Python files.
it_it: Una lista di moduli specificati con il nome del file Premi Ctrl+A per selezionare uno o più files di Python

source: A new version of GUI2Exe is available! Please go to
it_it: Una versione aggiornata di GUI2Exe è disponibile! Per favore visita

source: A short description of your application.
it_it: Una breve descrizione della tua applicazione

source: Abort
it_it: Interrompi

source: About
it_it: Informazioni

source: About GUI2Exe and the Creator...
it_it: Informazioni su GUI2Exe e il suo Autore...

source: Add &custom code...
it_it: Aggiungi &codice personalizzato...

source: Add Data Files
it_it: Aggiungi Data Files

source: Add Dll/Binary Files
it_it: Aggiungi Dll/Files Binary

source: Add Dylib/Frameworks
it_it: Aggiungi Dylib/Frameworks

source: Add Item(s)
it_it: Aggiungi Elemento(i)

source: Add Plist dictionary key/value pairs or edit an existing PList configuration.
it_it: Permette l'aggiunta di dizionari in formato PList o la rielaborazione di configurazioni PList esistenti.

source: Add Python Modules
it_it: Aggiungi Moduli Python

source: Add Python Packages
it_it: Aggiungi Pacchetti Python

source: Add Python Script...
it_it: Aggiungi Scripts di Python...

source: Add Python Scripts
it_it: Aggiungi Scripts di Python

source: Add XC Data Models
it_it: Aggiungi XC Data Models

source: Add a custom icon to your application. The icon will be shown in Windows Explorer. Hit Ctrl+A to add an item to the list and edit it.
it_it: Aggiungi un'icona personalizzata alla tua applicazione L'icona verrà visualizzata in Windows Explorer Premi Ctrl+A per aggiungere un elemento e modificarlo.

source: Add a new list item by hitting Ctrl+A and click on the third list control column to select your Python Main Script. You can change the executable kind (windows or console) by clicking on the second list control column, and modify other property of your target class as well.<note>The other options currently available in py2exe, namely service, com_server and ctypes_com_server are currently not implemented in GUI2Exe.
it_it: Aggiungi un nuovo elemento alla lista premendo Ctrl+A and clicca sulla terza colonna della lista per selezionare il module Python principale. E' possibile modificare il tipo di eseguibile (windows o console) cliccando sulla seconda colonna della lista, nonché modificare altre proprietà della tua classe in Python.<note>Le altre opzioni disponibili in py2exe, tra cui service, com_service e ctypes_com_server sono al momento non implementate in GUI2Exe.

source: Add a new project to the project tree
it_it: Aggiunge un nuovo progetto all'albero dei progetti

source: Add a new tree item below the selected item
it_it: Aggiunge un nuovo elemento all'albero, al di sotto dell'elemento selezionato

source: Add by Python code
it_it: Aggiungi usando codice Python

source: Add custom code to be executed after the building process
it_it: Aggiungi codice Python che sarà eseguito alla fine della compilazione

source: Add custom code to the setup script
it_it: Aggiungi codice Python personalizzato al file di setup

source: Add items to the list
it_it: Aggiungi elementi alla lista

source: Add one or more bitmaps as Windows resources, so that they get packaged in the executable. Hit Ctrl+A to add an item to the list and edit it.
it_it: Aggiunge uno o più files bitmap come risorse Windows, in modo che siano incluse nel file eseguibile. Premi Ctrl+A per aggiungere un elemento e modificarlo.

source: Add your key/value dictionary in Python code:
it_it: Aggiungi una coppia chiave/valore come dizionario Python:

source: Add/Edit
it_it: Aggiungi/Modifica

source: Allow PYTHONPATH to effect the interpreter's environment.
it_it: Permetti che PYTHONPATH modifichi l'ambiente dell'interprete

source: Always 1 on Linux/unix. On Windows, governs whether to use the console executable, or the Windows subsystem executable.
it_it: Sempre uguale a 1 in Linux/Unix. In Windows, stabilisce se usare la consolle dell'eseguibile o quella di Windows.

source: An optional list of binary files to exclude. Hit Ctrl+A to select one or more binary files.
it_it: Una lista opzionale di files binary da escludere. Premi Ctrl+A per selezionare uno o più files binary.

source: An optional list of binary files to include. Hit Ctrl+A to select one or more binary files.
it_it: Una lista opzionale di files binary da includere. Premi Ctrl+A per selezionare uno o più files binary.

source: An optional list of paths to be searched before sys.path. Hit Ctrl+A to select one or more directories.
it_it: Una lista opzionale di cartelle in cui cercare prima di sys.path. Premi Ctrl+A per selezionare una o più cartelle.

source: An optional list of paths used to extend the hooks package. Hit Ctrl+A to select one or more directories.
it_it: Una lista opzionale di cartelle per estendere il pacchetto hooks. Premi Ctrl+A per selezionare una o più cartelle.

source: Append
it_it: Aggiungi

source: Append Script To Executable
it_it: Aggiungi Lo Script All'Eseguibile

source: Append Script To Library
it_it: Aggiungi Lo Script Alla Libreria

source: Append a new tree item to the selected item
it_it: Appendi un nuovo elemento a quello selezionato

source: Arbitrary files to include in your distribution. Depending on the choice in the menu 'Options' ==> 'Recurse sub-dirs for DATA files option' there are 2 possibilities: - Choose multiple files at once; - Choose one or more directories: every file in them will be added recursively. Hit Ctrl+A to select one or more data files.
it_it: Files arbitrari da includere nella tua applicazione. In funzione della scelta nel menu 'Opzioni'==> 'Includi sotto-cartelle nell'opzione data_files' ci sono 2 possibilità: - Scegli più files in una volta sola; - Seleziona una o più cartelle: ogni file in queste cartelle viene aggiunto in modo ricorsivo. Premi Ctrl+A per aggiungere uno o più data files.

source: Are you sure you want to delete all the projects from your database?
it_it: Sei sicuro di voler cancellare tutti i progetti dal database?

source: Are you sure you want to delete the selected project(s) from your database?
it_it: Sei sicuro di voler cancellare i progetti selezionati dal database?

source: At present you have the latest version of GUI2Exe.
it_it: Al momento hai la versione più aggiornata di GUI2Exe.

source: Attempting to connect to the internet...
it_it: Cerco di connettermi a internet...

source: Author
it_it: Autore

source: AutoSaves your work every minute
it_it: Salva automaticamente il tuo lavoro ogni minuto

source: Binary
it_it: binari

source: Bitmap Path
it_it: Percorso Bitmap

source: Bitmap Resources
it_it: Risorse Bitmap

source: Boolean value indicating if dependent files should be copied to the target directory or not.
it_it: Valore booleano che indica se i file dipendenti devono essere copiati nella cartella di distribuzione.

source: Boolean value indicating if the script module should be appended to the shared library zipfile.
it_it: Valore booleano che indica se il modulo Python deve essere aggiunto alla libreria zipfile.

source: Boolean value indicating if the script module should be appended to the executable itself.
it_it: Valore booleano che indica se il modulo Python deve essere aggiunto all'eseguibile stesso.

source: Browse For Folders...
it_it: Seleziona una o più cartelle...

source: Build Optimized
it_it: Applica Ottimizzazione

source: Build optimized. PyInstaller will gather *.pyo files if it is run optimized.
it_it: Applica ottimizzazione. PyInstaller utilizza files *.pyo se si applica l'ottimizzazione.

source: Build output file %(filePath)s successfully saved
it_it: File di output %(filePath)s salvato correttamente

source: Build output text for %(projectName)s (%(compiler)s): Built on %(header)s
it_it: Testo di output per il progetto %(projectName)s (%(compiler)s): Compilato il %(header)s

source: Build output text successfully copied to the clipboard
it_it: L'output del compilatore é stato copiato nel clipboard

source: Builder
it_it: Compilatore

source: Bundle Files
it_it: Raggruppa Files

source: Bundle extension (default: '.app' for app, '.plugin' for plugins).
it_it: Estensione dell'applicazione (default: '.app' per un'applicazione, '.plugin' per i plugins).

source: Bundling options for the final dist directory. - Level 3: default for py2exe. No pyd or dll is bundled in the exe or in the zip-archive; - Level 2: includes the .pyd and .dll files into the zip-archive or the executable; - Level 1: includes the .pyd and .dll files into the zip-archive or the executable itself, and does the same for pythonXY.dll.<note>The Bundle Files option is currently not available on 64 bit machines.
it_it: Opzioni di raggruppamento per la directory di distribuzione: - Livello 3: il default per py2exe. Nessun file pyd o dll é aggiunto all'archivio zip; - Livello 2: i files pyd e dll sono inclusi nell'eseguibile o nell'archivio zip; - Livello 1: i files pyd e dll sono inclusi nell'eseguibile o nell'archivio zip, nonché il file PythonXY.dll<note>L'opzione Raggruppa Files non è al momento disponibile per le macchine a 64 bit.

source: Busy
it_it: Occupato

source: By activating this option in GUI2Exe, you can specify a name for the compressed zip file where py2exe will put all the bytecode-compiled Python modules. If you don't activate this option, or the zipfile name is empty, the default in GUI2Exe is to use zipfile=None. This means the compiled bytecode will be attached to the executable itself and no zip file will be created.<note>If you specify the Skip Archive option, zipfile can not be None.
it_it: Attivando questa opzione in GUI2Exe, puoi specificare un nome per l'archivio zip in cui py2exe inserirà i moduli Python compilati in byte-code. Se non attivi questa opzione, o sel il nome dell'archivio zip non è valido, il default in GUI2Exe è zipfile=None. Questo significa che i moduli Python compilati vengono aggiunti all'eseguibile e l'archivio zip non sarà creato.<note>Se specifichi l'opzione Escludi Archivio, zipfile non può essere None.

source: By choosing this option, py2exe will copy the Python bytecode files directly into the dist directory (or in the excutable itself). No zipfile archive is used.
it_it: Scegliendo questa opzione, py2exe copia i moduli Python compilati in byte-code direttamente nella cartella di distribuzione (o nell'eseguibile stesso). Nessun archivio zipfile viene usato.

source: By selecting a file for this option, your custom Python file can do things like installing a customized stdout blackhole. The custom boot script is executed during startup of the executable immediately after boot_common.py is executed.
it_it: Se selezioni uno script Python, questo tio permetterà di installare, per esempio, un stdout personalizzato. Questo file viene eseguito all'avviamento dell'eseguibile, subito dopo boot_common.py

source: Byte-compiling Python files...
it_it: Compilo i moduli Python in byte-code...

source: Cancel
it_it: Annulla

source: Change &Python version...
it_it: Cambia la version di &Python...

source: Check for &upgrade
it_it: Controlla a&ggiornamenti

source: Check for a GUI2Exe upgrade
it_it: Cerca possibili aggiornamenti alla versione corrente di GUI2Exe

source: Check the syntax of the auto-generated setup script
it_it: Controlla la sintassi del file di setup auto-generato da GUI2Exe

source: Choose a data files directory:
it_it: Scegli una cartella per i data files:

source: Choose one or more folders:
it_it: Seleziona una o più cartelle:

source: Choose the PyInstaller location:
it_it: Seleziona il percorso di PyInstaller:

source: Class
it_it: Classe

source: Clea&n "dist" directory
it_it: P&ulisci la cartella "dist"

source: Clean "dist" directory
it_it: Pulisci la cartella "dist"

source: Clean the distribution folder at every compilation
it_it: Pulisce la cartella di distribuzione "dist" ad ogni compilazione

source: Cleaning the distribution folder...
it_it: Pulisco la cartella di distribuzione...

source: Clear History
it_it: Cancella Cronologia

source: Clear all
it_it: Pulisci Tutto

source: Close
it_it: Chiudi

source: Comma-separated list of DLLs to exclude. Hit Ctrl+A to add a new item in the list and edit it.
it_it: Una lista di files dll da escludere Premi Ctrl+A per aggiungere un elemento e modificarlo.

source: Comma-separated list of Python modules to exclude. Hit Ctrl+A to add a new item in the list and edit it.<note>The Includes option is stronger than the Excludes one. So, if a module is present in both Includes and Excludes, it will be included in your final distribution.
it_it: Una lista di moduli Python da escludere. Premi Ctrl+A per aggiungere un nuovo elemento alla lista e modificarlo.<note>L'opzione Includes è più importante di quella Excludes. Quindi, se un modulo è presente sia in Includes che in Excludes, sarà incluso nell'eseguibile finale.

source: Comma-separated list of Python modules to ignore if they are found during the building process. Hit Ctrl+A to add a new item in the list and edit it.
it_it: Una lista di moduli Python da ignorare se vengono trovati durante il process di compilazione. Premi Ctrl+A per aggiungere un nuovo elemento alla lista e modificarlo.

source: Comma-separated list of Python modules to include. Hit Ctrl+A to add a new item in the list and edit it.<note>The Includes option is stronger than the Excludes one. So, if a module is present in both Includes and Excludes, it will be included in your final distribution.
it_it: Una lista di moduli Python da includere. Premi Ctrl+A per aggiungere un nuovo elemento alla lista e modificarlo.<note>L'opzione Includes è più importante di quella Excludes. Quindi, se un modulo è presente sia in Includes che in Excludes, sarà incluso nell'eseguibile finale.

source: Comma-separated list of Python packages to include. Hit Ctrl+A to add a new item in the list and edit it.
it_it: Una lista di pacchetti Python da includere. Premi Ctrl+A per aggiungere un nuovo elemento alla lista e modificarlo.

source: Comma-separated list of frameworks or dylibs to exclude. Hit Ctrl+A to select one or more dylibs or frameworks.
it_it: Una lista di frameworks or dylibs Python da escludere. Premi Ctrl+A per selezionare uno o più dylibs e frameworks.

source: Comma-separated list of frameworks or dylibs to include in your distribution. Hit Ctrl+A to select one or more dylibs or frameworks.
it_it: Una lista di frameworks or dylibs Python da includere nella distribuzione finale. Premi Ctrl+A per selezionare uno o più dylibs e frameworks.

source: Common Options
it_it: Opzioni comuni

source: Company Name
it_it: Nome compagnia

source: Compilation killed by user
it_it: Compilazione fermata dal'utente

source: Compile
it_it: Compila

source: Compiler Messages
it_it: Messaggi del Compiler

source: Compiler s&witches
it_it: Op&zioni del Compiler

source: Compressed
it_it: Compresso

source: Compression Level
it_it: Livello di Compressione

source: Console Application
it_it: Applicazione Console

source: Contact Andrea Gavana by e-mail
it_it: Contatta Andrea Gavana via e-mail

source: Copy Dependent Files
it_it: Copia Files Dipendenti

source: Copy to new project...
it_it: Copia su un nuovo progetto...

source: Copying existing project configuration...
it_it: Copio la configurazione del progetto esistente...

source: Copying files...
it_it: Copia dei file in corso...

source: Create Manifest File (MSW)
it_it: Crea File di Manifesto (MSW)

source: Creates a compressed zip archive (zipfile). It can be either 0 or a positive number, the meaning of activating/deactivating the compression is as follows: - No Compression: the zipfile will be created using the zipfile.ZIP_STORED Python option; - With Compression: the zipfile will be created using the zipfile.ZIP_DEFLATED Python option.<note>If you specify the Skip Archive option, compression can not be activated (no zipfile to compress).
it_it: Crea un archivio zip compresso (zipfile). Questa opzione può essere 0 o un numero positivo, e il significato del suo valore è specificato qui di seguito: - Senza Compressione: il file compresso viene creato usando l'opzione: zipfile.ZIP_STORED di Python; - Con Compressione: il file compresso viene creato usando l'opzione: zipfile.ZIP_DEFLATED di Python.<note> Se specifichi l'opzione Ometti Achivio, la compressione non può essere attivata (zipfile non è creato).

source: Creates a compressed zip file.
it_it: Crea un archivio zip compresso

source: Creates a file that instructs Windows on how to correctly render the widgets in your user interface. This file lives under 'other_resources' in py2exe.
it_it: Genera un file che istruisce Windows su come disegnare correttamente i controlli nella tua interfaccia utente. Questo file si trova in 'Altre Risorse' per py2exe.

source: Creating new project...
it_it: Creo un nuovo progetto...

source: Custom Boot Script
it_it: Script di Inizializzazione

source: Custom boot file is not a valid file.
it_it: Lo script di inizializzazione non è un file valido.

source: DLL Excludes
it_it: DLL Escluse

source: DLL Name
it_it: Nome DLL

source: DLL Names
it_it: Nomi DLL

source: DLL Path
it_it: Percorso DLL

source: DLL/Binary Excludes
it_it: DLL/File Binary Esclusi

source: DLL/Binary Includes
it_it: DLL/File Binary Inclusi

source: Database file is corrupted: using backup file
it_it: Il file di database è corrotto: uso il file di backup

source: Ddo not include encodings.<note>The default (on Python versions with unicode support) is now to include all encodings.
it_it: Non includere il modulo encodings.<note> Il default (per le versioni di Python che supportano unicode) è ora di includere tutti gli encodings.

source: De&lete "build" directory
it_it: Cance&lla la cartella "build"

source: Delete
it_it: Elimina

source: Delete "build" directory
it_it: Cancella la cartella "build"

source: Delete all projects
it_it: Elimina tutti i progetti

source: Delete project(s)
it_it: Elimina progetto(i)

source: Delete selected
it_it: Cancella selezionato(i)

source: Delete the build folder at every compilation
it_it: Elimina la cartella "build" ad ogni compilazione

source: Deletes the selected tree item (and everything below)
it_it: Cancella l'elemento selezionato nell'albero (e tutti gli elementi al di sotto)

source: Depend on an existing installation of Python 2.4+.
it_it: Dipende da un'installazione esistente di Python 2.4+

source: Depends on the kind of executable you wish to build: - windows: builds an executable for a GUI-based application; - console: creates an executable for a console program (i.e., no graphical interface stuff involved).
it_it: Dipende dal tipo di eseguibile che vuoi compilare: - windows: compila un eseguibile che contiene un'interfaccia utente; - console: crea un eseguibile per un programma console (es., nessuna interfaccia utente è presente).

source: Description
it_it: Descrizione

source: Directory
it_it: Cartella

source: Directory Name
it_it: Nome Cartella

source: Directory to put final built distributions in (default is dist).
it_it: Cartella che conterrà la distribuzione finale dell'eseguibile (il default è 'dist')

source: Discard
it_it: Abbandona

source: Dist Directory
it_it: Cartella di Distribuzione

source: Dist Directory Name
it_it: Nome Cartella di Distribuzione

source: Do not change to the data directory (Contents/Resources).<note> This is forced for plugins.
it_it: Non muovere nella cartella di dati (Contenuti/Risorse).<note>Questa opzione è obbligatoria per i plugins.

source: Do not strip debug and local symbols from output.
it_it: Non rimuovere i simboli locali e di debug

source: Double-click on one item in the tree control above:
it_it: Fai doppio click su un elemento dell'albero:

source: Drop to pdb console after the module finding phase is complete.
it_it: Passa alla console pdb quando la fase di ricerca moduli è completata.

source: Dry Run
it_it: Prova Generale

source: Duplicate
it_it: Duplica

source: Duplicates the selected tree item
it_it: Duplica l'elemento dell'albero selezionato

source: Dylib/Frameworks Excludes
it_it: Escludi Dylib/Frameworks

source: Dylib/Frameworks Includes
it_it: Includi Dylib/Frameworks

source: Dylib/Frameworks Names
it_it: Nomi Dylib/Frameworks

source: Edit preferences/settings
it_it: Modifica preferenze e settaggi

source: Edit project name
it_it: Modifica il nome del progetto

source: Elapsed time for the process: %02d:%02d:%02d
it_it: Tempo utilizzato dal processo: %02d:%02d:%02d

source: Empty dist_dir option. Using default value "dist"
it_it: L'opzione dist_dir è vuota. Uso il valore di default "dist"

source: Empty targetName option. Using Python script name
it_it: L'opzione targetName è vuota. Uso il nome dello script Python

source: Enter a name for the new configuration:
it_it: Inserisci il nome per la nuova configurazione:

source: Enter a name for the new project:
it_it: Inserisci il nome del nuovo progetto

source: Enter your custom code below and it will be inserted inside the
it_it: Digita il tuo codice personalizzato che verrà inserito nel

source: Error
it_it: Errore

source: Error Message
it_it: Messaggio di Errore

source: Error Traceback:
it_it: Traceback di Python:

source: Error/Crash Reporter
it_it: Finestra di Errore/Crash

source: Error: Oh no, something bad happened!
it_it: Errore: Oh no, è successo qualcosa di inaspettato!

source: Excludes
it_it: Escludi

source: Exe Kind
it_it: Tipo di Eseguibile

source: Executable Name
it_it: Nome dell'Eseguibile

source: Executable Properties
it_it: Proprietà dell'Eseguibile

source: Executable terminated with errors or warnings
it_it: L'eseguibile ha generato messaggi di errore o di avviso

source: Exit GUI2Exe
it_it: Esci da GUI2Exe

source: Export the Setup.py file
it_it: Esporta il file Setup.py

source: Export to clipboard
it_it: Esporta nel clipboard

source: Extension
it_it: Estensione

source: File %(filePath)s successfully saved
it_it: Il file %(filePath)s è stato salvato con successo

source: File Name
it_it: Nome File

source: Files Path
it_it: Percorso Files

source: Filter file extensions using wildcard separated by a comma:
it_it: Filtra le estensioni dei file usando wildcards separate da una virgola:

source: Filtering Dependencies...
it_it: Filtro le dipendenze...

source: Finding required modules...
it_it: Cerco i moduli necessari...
