Repository: sownthunder/Data-Developer-Droolkit
Catalog: GUI2Exe_0.5.3/scripts/catalogs/Gui2Exe_*.po
Languages: it_it

source: Flag whether to create the included python interpreter.
it_it: Segnala se creare l'interprete di Python oppure no.

source: Force Execpv
it_it: Forza Execpv

source: Force application to run translated on i386.
it_it: Obbliga l'applicazione a girare tradotta su i386

source: Force execpv (Linux/Unix only). Ensures that LD_LIBRARY_PATH is set properly.
it_it: Forza execpv (solo Linux/Unix). Assicura che LD_LIBRARY_PATH sia settato correttamente.

source: Full Build Output Dialog
it_it: Finestra per l'Output di Compilazione

source: GUI2Exe &API
it_it: &API di GUI2Exe

source: GUI2Exe &help
it_it: A&iuto di GUI2Exe

source: GUI2Exe Busy Message
it_it: Messaggio di Attesa per GUI2Exe

source: GUI2Exe Code Viewer
it_it: Visualizzatore Codice per GUI2Exe

source: GUI2Exe Help Tip
it_it: Suggerimento GUI2Exe

source: GUI2Exe Help Tip (%(compiler)s)
it_it: Suggerimento GUI2Exe (%(compiler)s)

source: GUI2Exe Preferences dialog
it_it: Dialogo di Preferenze per GUI2Exe

source: GUI2Exe Projects
it_it: Progetti GUI2Exe

source: GUI2Exe succesfully started at %(dateAndTime)s
it_it: GUI2Exe inizializzato con successo il %(dateAndTime)s

source: GUI2Exe: Check for upgrade
it_it: GUI2Exe: Cerca aggiornamenti

source: Generating "%(projectName)s" setup script...
it_it: Creo il file di setup per "%(projectName)s"...

source: Hooks Extensions
it_it: Estensioni Hooks

source: Icon File
it_it: Icona

source: Icon Path
it_it: Percorso dell'Icona

source: Icon Resources
it_it: Risorse Icone

source: Icon file is not a valid file.
it_it: Il file icona non è un file valido.

source: Icon file to use for your application.
it_it: Un file icona da applicare alla tua applicazione.

source: If activated, it allows you to add/edit PList dictionary key/value pairs, or to remove it altogether.
it_it: Se attivato, ti permette di aggiungere/modificare un dizionario PList di coppie chiave/valore, o di cancellarlo.

source: If you activate this switch, you will be able to specify the name the directory to put final built distributions in (the default is 'dist').
it_it: Se attivi questa opzione, puoi specificare il nome della cartella finale di distribuzione. (il default è 'dist').

source: If you have UPX installed (detected by Configure), this will use it to compress your executable (and, on Windows, your dlls)
it_it: Se hai installato UPX (rilevato da Configure) puoi usare questa opzione per comprimere l'eseguibile (e, in Windows, le dll).

source: Ignores
it_it: Ignora

source: Import from file...
it_it: Importa da file...

source: Include Python Interpreter
it_it: Includi l'interprete di Python

source: Include TCL/TK in the deployment.
it_it: Includi TCL/Tk nella distribuzione.

source: Include Tk
it_it: Includi Tk

source: Include the system and user site-packages into sys.path.
it_it: Include site-packages di sistema e dell'utente in sys.path.

source: Includes
it_it: Includi

source: Info.plist template file.
it_it: File di template Info.plist

source: Information about the programmer.
it_it: Informazioni a proposito del programmatore.

source: Initialization Script
it_it: Script di Inizializzazione

source: Initialization file is not a valid file.
it_it: Lo script di inizializzazione non è un file valido.

source: Insert a custom named resource into the executable. Hit Ctrl+A to add an item to the list and edit it.
it_it: Inserisci una risorsa personalizzata nell'eseguibile. Premi Ctrl+A per aggiungere un elemento alla lista e modificarlo.

source: Invalid PList code encountered.
it_it: Codice PList invalido.

source: Invalid PyInstaller path: no file named 'Build.py' has been found.
it_it: Il percorso per PyInstaller è invalido. Non sono riuscito a trovare il file 'Build.py'.

source: Invalid Python code entered.
it_it: Il codice Python inserito non è valido.

source: Invalid folder name.
it_it: Il nome della cartella non è valido.

source: Invalid or corrupted project file.
it_it: Il file di progetto sembra corrotto o non valido.

source: Invalid or empty property name.
it_it: Il nome della proprietà non è valido.

source: Invalid perspective name!
it_it: Il nome della prospettiva non è valido!

source: Invalid project name (empty string).
it_it: Il nome del progetto non è valido (vuoto).

source: It appears that the executable generated errors in file: %(logFile)s Do you want to examine the tracebacks?
it_it: Sembra che l'eseguibile abbia generato errori nel file: %(logFile)s Vuoi esaminare il traceback di Python?

source: Kill
it_it: Termina

source: Language:
it_it: Lingua:

source: List of names of modules to exclude. Hit Ctrl+A to add an item to the list and edit it.
it_it: Lista di moduli da escludere. Premi Ctrl+A per aggiungere un elemento alla lista e modificarlo.

source: List of names of modules to exclude. Hit Ctrl+A to select one or more Python modules.
it_it: Lista di moduli da escludere. Premi Ctrl+A per selezionare uno o più moduli Python.

source: List of names of modules to include. Hit Ctrl+A to add an item to the list and edit it.
it_it: Lista di moduli da includere. Premi Ctrl+A per aggiungere un elemento alla lista e modificarlo.

source: List of names of modules to include. Hit Ctrl+A to select one or more Python modules.
it_it: Lista di moduli da includere. Premi Ctrl+A per selezionare uno o più moduli Python.

source: List of names of packages to include, including all of the package's submodules. Hit Ctrl+A to add an item to the list and edit it.
it_it: Lista di pacchetti Python da includere, compresi tutti i sotto-pacchetti. Premi Ctrl+A per aggiungere un elemento alla lista e modificarlo.

source: List of names of packages to include. Hit Ctrl+A to select one or more Python packages.
it_it: Lista di pacchetti Python da includere. Premi Ctrl+A per selezionare uno o più pacchetti Python.

source: List of paths to search for modules. Hit Ctrl+A to select one or more directories.
it_it: Lista di cartelle in cui cercare i moduli. Premi Ctrl+A per selezionare una o più cartelle.

source: Load another GUI2Exe database file
it_it: Carica un altro database per GUI2Exe

source: Load project(s)
it_it: Carica progetto(i)

source: Locale Settings
it_it: Impostazioni locali

source: Main Module
it_it: Modulo Principale

source: Make sure you have the license if you distribute any of them, and
it_it: Assicurati di avere la licenza se li distribuisci, e

source: Message
it_it: Messaggio

source: Messages And Actions
it_it: Messaggi e Azioni

source: My Projects
it_it: I Miei Progetti

source: Name of icon which should be included in the executable itself on Windows or placed in the target directory for other platforms.
it_it: Il nome dell'icona che sarà assegnata all'eseguibile in Windows o copiata nella cartella di distribuzione per gli altri sistemi operativi.

source: New Child
it_it: Nuovo Figlio

source: New Sibling
it_it: Nuovo Elemento

source: New data files
it_it: Nuovo data file

source: New project
it_it: Nuovo progetto

source: New project "%(projectName)s" added
it_it: Nuovo progetto "%(projectName)s" aggiunto

source: New project...
it_it: Nuovo progetto...

source: New property dialog
it_it: Finestra per la nuova proprietà

source: New resources
it_it: Nuove risorse

source: No Author
it_it: Nessun Autore

source: No Company
it_it: Nessuna Compagnia

source: No Copyrights
it_it: Nessun Copyright

source: No Description
it_it: Nessuna Descrizione

source: No Python code has been entered.
it_it: Non è stato inserito codice Python.

source: No Python scripts have been added.
it_it: Nessuno script Python è stato aggiunto.

source: No SyntaxError detected in the automatically generated Setup.py file.
it_it: Nessun errore di sintassi (SyntaxError) è stato rilevato nello script di setup.

source: On Windows, it creates a manifest file that instructs Windows on how to correctly render the widgets in your user interface.
it_it: In Windows, crea un file di manifesto che istruisce il sistema operativo su come disegnare correttamente i controlli nella tua interfaccia utente.

source: One Directory
it_it: Singola Cartella

source: One File
it_it: Singolo File

source: One instance of the building process is already running.
it_it: Una istanza del processo di compilazione è già in corso.

source: Opens the GUI2Exe API reference
it_it: Mostra il manuale API di GUI2Exe

source: Opens the GUI2Exe help
it_it: Apre l'aiuto per GUI2Exe

source: Optimization level for the compiled bytecode. 0: No optimization on the compiled bytecode; 1 (Python -O): Optimize the generated bytecode; 2 (Python -OO): remove doc-strings in addition to the -O optimizations.
it_it: Livello di ottimizzazione per il codice compilato. 0: Nessuna ottimizzazione nel codice compilato; 1 (Python -O): ottimizza il codice generato; 2 (Python -OO): rimuove le docstrings in aggiunta all'ottimizzazione -O.

source: Optimize
it_it: Ottimizza

source: Other Options
it_it: Altre Opzioni

source: Other Resources
it_it: Altre Risorse

source: Output module dependency graph.
it_it: Stampa il grafico di dipendenza tra moduli

source: PList Code
it_it: Codice PList

source: PList File
it_it: File PList

source: PList file is not a valid file.
it_it: Il File PList non e valido

source: Packages
it_it: Pacchetti

source: Packages (PKG)
it_it: Pacchetti (PKG)

source: Path
it_it: Percorso

source: Path Extensions
it_it: Estensione Percorsi

source: Path/Value
it_it: Percorso/Valore

source: Paths
it_it: Percorsi

source: Perspective %d
it_it: Prospettiva %d

source: Please double-click on one of the tree items, to which the
it_it: Fai doppio-click su uno degli elementi dell'albero, al quale il

source: Please enter the name of the folder for py2exe:
it_it: Inserisci il nome della cartella per py2exe:

source: Please insert the property name and select its type below:
it_it: Inserisci il nome della proprietà e seleziona il suo tipo:

source: Please select a GUI2Exe project file...
it_it: Seleziona un progetto GUI2Exe

source: Please select one directory...
it_it: Seleziona una cartella...

source: Please select one item in the tree.
it_it: Seleziona un elemento nell'albero.

source: Please select the new Python executable ...
it_it: Seleziona il nuovo eseguibile Python...

source: Preferences
it_it: Preferenze

source: Preferences...
it_it: Preferenze...

source: Produces a single directory deployment (default).
it_it: Copia tutti i files in una singola cartella di distribuzione (default).

source: Produces a single file deployment.
it_it: Crea un singolo file eseguibile.

source: Program Name
it_it: Nome Programma

source: Project "%(projectName)s" successfully loaded
it_it: Il progetto "%(projectName)s" è stato caricato correttamente

source: Project %(existingProject)s succesfully copied to %(newProject)s
it_it: Il progetto %(existingProject)s è stato copiato con successo in %(newProject)s

source: Project %(projectName)s successfully exported to file %(filePath)s
it_it: Ho esportato con successo il progetto %(projectName)s nel file %(filePath)s

source: Project successfully updated from file.
it_it: Progetto correttamente aggiornato da file

source: Projects
it_it: Progetti

source: Property List
it_it: Lista Proprietà

source: Property Name:
it_it: Nome Properità:

source: Property Type:
it_it: Tipo Proprietà:

source: Property Value (optional)
it_it: Valore proprietà (opzionale)

source: Py2Exe Binary Dependencies
it_it: File Binari Necessari per Py2Exe

source: Py2Exe Missing Modules
it_it: Moduli Mancanti per Py2Exe

source: Py2Exe Sample File
it_it: File di Py2Exe

source: Py2Exe thinks that these modules (and sub-modules) are missing.
it_it: Py2Exe pensa che i seguenti moduli (e sotto-moduli) siano mancanti.

source: Py2app allows you to include one (or more) series of files that you are going to need to run your executable Depending on the choice in the menu 'Options' ==> 'Recurse sub-dirs for DATA files option' there are 2 possibilities: - Choose multiple files at once; - Choose one or more directories: every file in them will be added recursively. Hit Ctrl+A to add data files to the list.
it_it: Py2app ti permette di includere una o più serie di files che ti serviranno per lanciare l'eseguibile. In funzione della scelta nel menu 'Opzioni' ==> 'Includi sotto-directory per l'opzione data_files' ci sono 2 possibilità: - Scegli uno o più file in una volta sola; - Seleziona una o più cartelle: ogni file in queste cartelle sarà aggiunto ricorsivamente. Premi Ctrl+A per aggiungere data files alla lista.

source: Py2app options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni Py2app per: %(projectName)s (Creato: %(creationDate)s)

source: Py2exe allows you to include one (or more) series of files that you are going to need to run your executable Depending on the choice in the menu 'Options' ==> 'Recurse sub-dirs for DATA files option' there are 2 possibilities: - Choose multiple files at once; - Choose one or more directories: every file in them will be added recursively. Hit Ctrl+A to add data files to the list.
it_it: Py2exe ti permette di includere una o più serie di files che ti serviranno per lanciare l'eseguibile. In funzione della scelta nel menu 'Opzioni' ==> 'Includi sotto-directory per l'opzione data_files' ci sono 2 possibilità: - Scegli uno o più file in una volta sola; - Seleziona una o più cartelle: ogni file in queste cartelle sarà aggiunto ricorsivamente. Premi Ctrl+A per aggiungere data files alla lista.

source: Py2exe options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni Py2exe per: %(projectName)s (Creato: %(creationDate)s)

source: PyInstaller options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni PyInstaller per: %(projectName)s (Creato: %(creationDate)s)

source: PyInstaller path has not been set. Please set the PyInstaller
it_it: Il percorso di PyInstaller non è stato selezionato. Per favore inserisci il percorso di PyInstaller.

source: Python Main Script
it_it: Script di Python

source: Python Modules
it_it: Moduli Python

source: Python Packages
it_it: Pacchetti Python

source: Python Scripts
it_it: Scripts di Python

source: Python executable changed from %(oldVersion)s to %(newVersion)s
it_it: L'eseguibile Python è stato cambiato da %(oldVersion)s a %(newVersion)s

source: Python main script is not a valid file.
it_it: Lo script di Python non è un file valido.

source: Python script: %(scriptName)s Is not a valid file.
it_it: Lo script di Python: %(scriptName)s Non è un file valido.

source: Question
it_it: Domanda

source: Quit
it_it: Esci

source: Recurse sub-directories for data_files option if checked
it_it: Se selezionato, include le sotto-directory per l'opzione data_files

source: Recurse sub-dirs for data_files option
it_it: Includi sotto-directory per l'opzione data_files

source: Reload opened projects at start-up
it_it: Ricarica i progetti aperti allo start-up

source: Remember GUI2Exe window position on exit
it_it: Ricorda la posizione della finestra GUI2Exe

source: Remember GUI2Exe window size on exit
it_it: Ricorda le dimensioni della finestra GUI2Exe

source: Remember last used compiler for all projects
it_it: Salva l'ultimo compilatore utilizzato per ogni progetto

source: Remove
it_it: Elimina

source: Remove existing PList code.
it_it: Rimuovi il codice PList esistente

source: Remove items from the list
it_it: Rimuovi elementi dalla lista

source: Report Error
it_it: Segnala Errore

source: Resources
it_it: Risorse

source: Restore GUI configuration: %s
it_it: Ripristina l'interfaccia: %s

source: Restore original
it_it: Ripristina l'originale

source: Restore original &GUI
it_it: Ripristina l'interfaccia originale

source: Restore the original GUI appearance
it_it: Ripristina l'interfaccia utente originale

source: Running compilation steps...
it_it: Lancio le fasi di compilazione...

source: Save
it_it: Salva

source: Save &panes configuration...
it_it: Salva configurazione &pannelli

source: Save file as ...
it_it: Salva come...

source: Save file as...
it_it: Salva file come...

source: Save the current GUI panes configuration
it_it: Salva la disposizione corrente dei pannelli

source: Save the current project to a file
it_it: Salva il progetto in un file

source: Save the current project to database
it_it: Salva il progetto nel database

source: Save to file...
it_it: Salva su file...

source: Saving panels configuration
it_it: Salvo la configurazione dei pannelli

source: Set P&yInstaller path...
it_it: Seleziona il percorso per P&yInstaller

source: Sets the PyInstaller installation path
it_it: Seleziona la cartella di installazione di PyInstaller

source: Setting to 1 gives you progress messages from the executable (for a console=0, these will be annoying MessageBoxes).
it_it: Se selezionato, fornisce messaggi dall'eseguibile (se usato con console=0, i messaggi sono mostrati in ripetitive finestre).

source: Setup file succesfully compiled
it_it: Il file di setup è stato compilato con successo

source: Setup script for "%(projectName)s" succesfully created
it_it: Creazione del file di setup per "%(projectName)s" completata

source: Show &full build output
it_it: Visuali&zza il rapporto del compilatore

source: Show compilation tips and tricks
it_it: Visualizza suggerimenti e trucchi per la compilazione

source: Show compilers switches and common options
it_it: Visualizza le opzioni per i compilatori e opzioni comuni

source: Show t&ooltips
it_it: Vis&ualizza suggerimenti

source: Simple PList editor for py2app
it_it: Semplice editor per le PList di py2app

source: Size (MB)
it_it: Dimensioni (MB)

source: Skip macholib phase.<note>Your App will not be standalone.
it_it: Salta la fase di macholib.<note>La tua applicazione non sarà indipendente.

source: Skipping Python loaders/byte-compilation...
it_it: Salto la compilazione dei Python loaders...

source: Starting compilation with Python executable: %(pythonExecutable)s
it_it: Compilazione iniziata con l'eseguibile Python: %(pythonExecutable)s

source: Starting compiled executable...
it_it: Lancio l'eseguibile compilato...

source: Strip Executable
it_it: Svuota Eseguibile

source: Sub-Module 1
it_it: Sotto-Modulo 1

source: Sub-Module 2
it_it: Sotto-Modulo 2

source: Sub-Module 3
it_it: Sotto-Modulo 3

source: Switch project &database...
it_it: Cambia il data&base dei progetti...

source: SyntaxError at line %d, column %d
it_it: Errore di sintassi alla linea %d, colonna %d

source: Target Class
it_it: Classe Obiettivo

source: Target Classes
it_it: Classi Obiettivo

source: Temporarily changes the Python version
it_it: Cambia temporaneamente la versione di Python

source: Test the compiled file (if it exists)
it_it: Testa l'eseguibile compilato (se esiste)

source: The Dry-Run option is available only for Py2Exe.
it_it: L'opzione Dry-Run è disponibile solo per Py2Exe.

source: The Python main script you want to convert to an executable.
it_it: Lo script principale di Python che vuoi convertire in eeguibile.

source: The Zlib compression level to use. If 0, the zlib module is not required.
it_it: Il livello di compressione per zlib. Se è 0, il modulo zlib non è necessario.

source: The compiler has successfully built your executable.
it_it: La fase di compilazione è terminata con successo.

source: The compiler selected is ==> %(compiler)s <==
it_it: Il compilatore selezionato è ==> %(compiler)s <==

source: The current code has changed. Do you want to save changes?
it_it: Il codice è stato cambiato. Vuoi salvare i cambiamenti?

source: The database file and its backup seem to be broken.
it_it: Il file di database e il suo backup sembrano corrotti.

source: The directory in which to place the target executable and any dependent files.
it_it: La cartella in cui copiare l'eseguibile e tutti i file dipendenti.

source: The directory in which to place the target executable and any dependent files.<note>This is used only when 'onedir' is set to 1.
it_it: La cartella in cui copiare l'eseguibile e tutti i file dipendenti.<note>Questa opzione è usata solo se 'onedir' è 1.

source: The executable and all shared libraries will be run through strip.<note>Note that cygwin's strip tends to render normal Win32 dlls unusable.
it_it: L'eseguibile e tutte le librerie condivise vengono ripulite con strip.<note>Nota che lo strip in cygwin può rendere inutilizzabili le normali dll in Windows.

source: The filename for the executable.
it_it: Il nome dell'eseguibile.

source: The gui_only flag only has a meaning on Windows: If set, the executable created for this script will not open a console window.
it_it: L'opzione gui_only ha senso solo in Windows. Se Selezionata l'eseguibile generato non aprirà una finestra DOS.

source: The name of the initialization script that will be executed before the actual script is executed; this script is used to set up the environment for the executable; if a name is given without an absolute path the names of files in the initscripts subdirectory of the cx_Freeze package is searched.
it_it: Il nome dello script di inizializzazione che viene eseguito prima dell'eseguibile. Questo script è usato per modificare l'ambiente dell'eseguibile. Se non viene specificato l'intero percorso per questo file, la sotto-cartella initscripts di cx_Freeze verrà utilizzata per cercare lo script.

source: The name of the target executable; the default value is the name of the script with the extension exchanged with the extension for the base executable.
it_it: Il nome dell'eseguibile. I valore di default è il nome dello script Python in cui l'estensione viene modificata in funzione del sistema operativo in uso.

source: The program name
it_it: Il nome del programma.

source: The project name you chose already exists.
it_it: Un progetto con lo stesso nome esiste già.

source: The selected file is not a Python executable.
it_it: Il file selezionato non è un eseguibile Python

source: This command line switch instructs py2app to create a Python module cross reference and display it in the webbrowser. This allows to answer question why a certain module has been included, or if you can exlude a certain module and its dependencies.
it_it: Questa opzione forza py2app a creare una referenza incrociata tra i moduli Python e a visualizzarla in una finestra del browser. Questo ti permetterà di capire perchè un determinato modulo è stato incluso o se ti è possibile escludere un modulo e le sue dipendenze.

source: This command line switch instructs py2exe to create a Python module cross reference and display it in the webbrowser. This allows to answer question why a certain module has been included, or if you can exlude a certain module and its dependencies.
it_it: Questa opzione forza py2exe a creare una referenza incrociata tra i moduli Python e a visualizzarla in una finestra del browser. Questo ti permetterà di capire perchè un determinato modulo è stato incluso o se ti è possibile escludere un modulo e le sue dipendenze.

source: This is the Setup file as it comes out after the pre-processing
it_it: Questo è il file di setup generato da GUI2Exe

source: This is the about dialog of GUI2Exe.
it_it: Questo è il dialogo informazioni di GUI2Exe.

source: This option has not been implemented yet.
it_it: Questa opzione non è al momento disponibile.

source: This option is available only for Py2Exe.
it_it: Questa opzione è disponibile solo per Py2Exe.

source: This project has never been compiled or its executable has been deleted.
it_it: Questo progetto non è mai stato compilato o il suo eseguibile è stato cancellato.

source: This project has not been compiled with %(compiler)s yet.
it_it: Questo progetto non è stato compilato con %(compiler)s.

source: This project has not been compiled yet.
it_it: Questo progetto non è stato ancora compilato.
