Repository: sownthunder/Data-Developer-Droolkit
Catalog: GUI2Exe_0.5.3/scripts/catalogs/Gui2Exe_*.po
Languages: it_it

source: This project has not been saved yet. Please save it and retry.
it_it: Il progetto non è stato ancora salvato. Per favore salva e riprova.

source: Time
it_it: Tempo

source: To prevent unicode encoding error, py2exe now by default includes the codecs module and the encodings package. If you are sure your program never implicitely or explicitely has to convert between unicode and ascii strings this can be prevented by switching on this option in its associated check box in GUI2Exe.
it_it: Per prevenire errori di encodings mancanti, il default di py2exe è includere i moduli codecs e il pacchetto encodings. Se sei sicuro che la tua applicazione non usa, implicitamente o esplicitamente, caratteri unicode, puoi escludere questi moduli selezionando il checkbox in GUI2Exe.

source: Tracebacks in log file
it_it: Errori nel file log

source: Type
it_it: Tipo

source: UPX Compression
it_it: Compressione UPX

source: Unable to connect to the internet.
it_it: Impossibile connettersi a internet.

source: Unable to open the clipboard.
it_it: Impossibile aprire il clipboard.

source: Unbuffered STDIO (same as Python -u).
it_it: Unbuffered STDIO (come Python -u).

source: Updating project from file...
it_it: Aggiorno il progetto da file...

source: Use &AutoSave
it_it: Usa &AutoSave

source: Use Site.py
it_it: Usa Site.py

source: Use argv emulation.<note> This is disabled for plugins.
it_it: Usa emulazione argv.<note>Questa opzione è disabilitata per i plugins.

source: Use last UI perspective at start-up
it_it: Utilizza l'ultima prospettiva allo start-up

source: Use site.py. The opposite of Python -S.<note>Note that site.py must be in the executable's directory to be used.
it_it: Usa site.py. È l'opposto di Python -S.<note>Nota che site.py deve trovarsi nella cartella dell'eseguibile.

source: User Interface
it_it: Interfaccia Utente

source: Value
it_it: Valore

source: Verbose Import
it_it: Importa Verboso

source: Verbose imports (same as Python -v).
it_it: Importa verboso (come Python -v).

source: Version
it_it: Versione

source: Version File
it_it: File di Versione

source: Version file is not a valid file.
it_it: Il file di versione non è valido.

source: View &setup script
it_it: Visualizza file di &setup

source: View the auto-generated setup script
it_it: Visualizza il file di setup generato da GUI2Exe

source: View the full build output for the current compiler
it_it: Visualizza l'output del compilatore

source: Warning
it_it: Attenzione

source: Warning Option
it_it: Opzione Warning

source: Warning option (Python 2.1+).
it_it: Opzione Warning (Python 2.1+).

source: Warning: the selected page contains unsaved data. Do you wish to save this project?
it_it: Attenzione: la pagina selezionata contiene dati non salvati. Vuoi salvare il progetto?

source: Welcome to GUI2Exe
it_it: Benvenuti in GUI2Exe

source: What the compiler says are the binary dependencies (py2exe only)
it_it: Quali sono i file binari dipendenti secondo il compilatore (solo py2exe)

source: What the compiler thinks are the missing modules (py2exe only)
it_it: I moduli mancanti secondo il compilatore (solo py2exe)

source: Window Transparency:
it_it: Trasparenza Finestra

source: Windows NT family only. icon='myicon.ico' to use an icon file.
it_it: Solo la famiglia di Windows NT. icon='myicon.ico' per usare un file icona.

source: Windows NT family only. version='myversion.txt'.<note>Use the PyInstaller Python file 'GrabVersion.py' to steal a version resource from an executable, and then edit the output to create your own. (The syntax of version resources is so arcane that I wouldn't attempt to write one from scratch).
it_it: Solo la famiglia di Windows NT. version='myversion.txt'.<note>Puoi utilizzare il file Python 'GrabVersion.py' nella cartella PyInstaller per estrarre una versione da un eseguibile, e quindi modificarlo secondo i tuoi gusti. (Non cercare di scriverlo da solo, la sua sintassi è molto complessa).

source: XC Data Models Names
it_it: Nomi XC Data Models

source: You can edit the properties below or add new ones:
it_it: Puoi modificare le proprietà qui di seguito o aggiungerne di nuove:

source: Your GUI2Exe preferences can be edited below:
it_it: Le tue preferenze per GUI2Exe qui di seguito:

source: Your program version.
it_it: La versione del tuo programma.

source: bbFreeze options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni bbFreeze per: %(projectName)s (Creato: %(creationDate)s)

source: cx_Freeze Sample File
it_it: File Esempio cx_Freeze

source: cx_Freeze options for: %(projectName)s (Created: %(creationDate)s)
it_it: Opzioni cx_Freeze per: %(projectName)s (Creato: %(creationDate)s)

source: show tooltips for the various compiler options
it_it: visualizza suggerimenti per le varie opzioni dei compilatori

source: tooltips
it_it: suggerimenti

source: xcdatamodels to be compiled and copied into Resources. Hit Ctrl+A to select one or more xcdatamodels.
it_it: xcdatamodels che sono compilati e copiati dentro Risorse.

source: zipfile does not have ".zip" extension
it_it: zipfile non ha l'estensione ".zip"
